000_РОЗНИЦА_ЦЕНТР/src/Catalogs/НастройкиСлужбДоставки/НастройкиСлужбДоставки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НастройкиСлужбДоставки</name>
  <attributes>
    <name>СлужбаДоставки</name>
    <type>
      <types>EnumRef.ОператорыДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>СтоимостьДоставки</name>
    <attributes>
      <name>ТипДоставки</name>
      <type>
        <types>EnumRef.ТипыДоставки</types>
      </type>
    </attributes>
    <attributes>
      <name>МаксимальнаяСуммаПосылки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СуммаДоставки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

000_РОЗНИЦА_ЦЕНТР/src/CommonModules/ЗаказПокупателяВызовСервера/Module.bsl
#Область ПрограммныйИнтерфейс

Функция СтоимостьДоставки(ДатаДокумента, СлужбаДоставки, ТипДоставки) Экспорт

	Результат = Справочники.НастройкиСлужбДоставки.СтоимостьДоставки(ДатаДокумента
		, СлужбаДоставки
		, ТипДоставки);

	Возврат Результат;
	
КонецФункции
#КонецОбласти

#Область СлужебныйПрограммныйИнтерфейс

// Код процедур и функций

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Код процедур и функций

#КонецОбласти
